// 変数holidaysに0～16までの整数を代入する
let holidays = ['正月','成人の日','建国記念日','天皇誕生日','春分の日','昭和の日','憲法記念日','みどりの日','こどもの日','海の日','山の日','敬老の日','秋分の日','スポーツの日','文化の日','勤労感謝の日'];

// 変数indexに0だけの整数を代入する
let index = 0;

while (index < holidays.length) {
  console.log(holidays[index]);
  index++;
}


// constで配列の宣言と値の代入を行う事はしなくていいのか？→　const holidays = ["正月","成人の日","建国記念日","天皇誕生日","春分の日","昭和の日","憲法記念日","みどりの日","こどもの日","海の日","山の日","敬老の日","秋分の日","スポーツの日","文化の日","勤労感謝の日"];


//for(初期値; 条件式; 変化式){繰り返す処理}

for (let i = 0; i < holidays.length; i++)
{
  console.log(holidays[i]);
}